#include<iostream>
#include<math.h>
#include<vector>
#include <Windows.h>
using namespace std;

int main() {
	setlocale(LC_ALL, "rus");
	int data, mounth;
	cout << "Введите число и месяц :";
	cin >> data >> mounth;
	vector <string> x = { "первое", "второе", "третье", "четвертое", "пятое", "шестое",
	"седьмое", "восьмое", "девятое", "десятое", "одиннадцатое" ,"двенадцатое" , "тринадцатое",
	"четырнадцатое", "пятнадцатое", "шестнадцатое", "семнадцатое", "восемнадцатое",
	"девятнадцатое", "двадцатое", "двадцать первое", "двадцать второе", "двадцать третье",
	"двадцать четверное", "двадцать пятое", "двадцать шестое", "двадцать седьмое", "двадцать восьмое", "двадцать девятое", "тридцатое", "тридцать первое"};
	vector <string> y = { "января", "февраля", "марта", "апреля", "мая", "июня",
	"июля", "августа", "сентября", "октября", "ноября", "декабря"};
	cout << x[data - 1] << " " << y[mounth - 1];
	}
