//#include<iostream>
//#include<math.h>
//#include<vector>
//#include <Windows.h>
//using namespace std;
//int main() {
//	SetConsoleCP(1251);
//	SetConsoleOutputCP(1251);
//	setlocale(LC_ALL, "rus");
//	int x;
//	cout << "Введите количество заданий :";
//	cin >> x;
//	SetConsoleCP(1251);
//	SetConsoleOutputCP(1251);
//	setlocale(LC_ALL, "rus");
//	vector <string> day = { "десять", "одиннадцать", "двенадцать", "тринадцать",
//	"четырнадцать", "пятнадцать", "шестнадцать ", "семнадцать", "восемнадцать",
//	"девятнадцать", "двадцать", "двадцать одно", "двадцать два", "двадцать три", 
//	"двадцатьчетыре", "двадцать пять", "двадцать шесть", "двадцать семь", "двадцать восемь",
//	"двадцатьдевять", "тридцать", "тридцать одно", "тридцать два", "тридцать три", "тридцать четыре",
//	"тридцать пять", "тридцать шесть", "тридцать семь", "тридцать восемь", "тридцать девять","сорок" };
//	cout << day[x-10];
//	if (x > 9 && x < 21) cout << "  " <<" учебных заданий";
//	else if (x == 21 || x == 31) cout << "  " << " учебное задание";
//	else if (x > 21 && x < 31) cout << "  " << "учебных заданий ";
//	else if (x > 31 && x < 41) cout << "  " << "учебных  заданий ";
//}